20240929230642-portfolio_8.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-29 Sun 23:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Portfolio 8</title>
<meta name="author" content="chameko" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="imagine.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Portfolio 8</h1>
<p>
Many problems throughout our world can be described in terms of items/objects and the relationships between them. This makes graph based neural networks an incredibly incising and exciting field. It took me a while to fully understand how graph based neural networks work, due to their inherit differences from standard deep neural networks. For this topic I found that attempting to learn it at face value with my previous knowledge from other types of neural networks wasn't that helpful. Instead it was more useful to start from the basics and work my way up. This is because graph neural networks have to operate so uniquely compared to the other networks to allow them to take advantage of the connections that graphs represent. This is primarily achieved through message passing and the various ways of accomplishing that. However what I've learned only applies to homogeneous graph networks, and for my task I want to represent the connections between two kinds of nodes, exemplars and normal windows. This means that I need to learn more about heterogeneous graphs. Currently I think that using GAT, or graph attention networks, would be the best starting point for my project because I want to assign different attention levels between exemplars and the other typical windows so network can learn which exemplars and windows hold more important information and propagate that through the network.
</p>

<p>
While I am still behind in terms of what I wanted to achieve, I have confidence that I'll soon be able to develop and start testing a model.
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: chameko</p>
<p class="date">Created: 2024-09-29 Sun 23:33</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
